Revit 2026 API

# Wood Properties

---

The Wood type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TextureAngle | The property labeled "Angle" from the "Wood" schema. |
|  | TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "Wood" schema. |
|  | TextureRealWorldOffsetX | The property labeled "Offset X" from the "Wood" schema. |
|  | TextureRealWorldOffsetY | The property labeled "Offset Y" from the "Wood" schema. |
|  | TextureRealWorldOffsetZ | The property labeled "Offset Z" from the "Wood" schema. |
|  | WoodAxialNoise | The property labeled "Axial Noise" from the "Wood" schema. |
|  | WoodColor1 | The property labeled "Color 1" from the "Wood" schema. |
|  | WoodColor2 | The property labeled "Color 2" from the "Wood" schema. |
|  | WoodRadialNoise | The property labeled "Radial Noise" from the "Wood" schema. |
|  | WoodThickness | The property labeled "Grain Thickness" from the "Wood" schema. |

#### Reference

Wood Class

Autodesk.Revit.DB.Visual Namespace